
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/16337835353)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.store_products.aws_dms_replication_task.this
* Update
  * module.bastion.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0b37217ff2730f86a"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "live-fire-exercise-bastion-sg"
        tags                   = {
            "Name" = "live-fire-exercise-bastion-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.store_products.aws_dms_replication_task.this will be created
  + resource "aws_dms_replication_task" "this" {
      + cdc_start_position        = (known after apply)
      + id                        = (known after apply)
      + migration_type            = "cdc"
      + region                    = "ap-northeast-1"
      + replication_instance_arn  = "arn:aws:dms:ap-northeast-1:891377385718:rep:BKEH7YNJTZDZVP7XD62UKCFCFQ"
      + replication_task_arn      = (known after apply)
      + replication_task_id       = "store-products"
      + replication_task_settings = jsonencode(
            {
              + BeforeImageSettings                 = null
              + ChangeProcessingDdlHandlingPolicy   = {
                  + HandleSourceTableAltered   = true
                  + HandleSourceTableDropped   = true
                  + HandleSourceTableTruncated = true
                }
              + ChangeProcessingTuning              = {
                  + BatchApplyMemoryLimit         = 500
                  + BatchApplyPreserveTransaction = true
                  + BatchApplyTimeoutMax          = 30
                  + BatchApplyTimeoutMin          = 1
                  + BatchSplitSize                = 0
                  + CommitTimeout                 = 1
                  + MemoryKeepTime                = 60
                  + MemoryLimitTotal              = 1024
                  + MinTransactionSize            = 1000
                  + RecoveryTimeout               = -1
                  + StatementCacheSize            = 50
                }
              + CharacterSetSettings                = null
              + ControlTablesSettings               = {
                  + ControlSchema                 = ""
                  + FullLoadExceptionTableEnabled = false
                  + HistoryTableEnabled           = false
                  + HistoryTimeslotInMinutes      = 5
                  + StatusTableEnabled            = false
                  + SuspendedTablesTableEnabled   = false
                }
              + ErrorBehavior                       = {
                  + ApplyErrorDeletePolicy                      = "IGNORE_RECORD"
                  + ApplyErrorEscalationCount                   = 0
                  + ApplyErrorEscalationPolicy                  = "LOG_ERROR"
                  + ApplyErrorFailOnTruncationDdl               = false
                  + ApplyErrorInsertPolicy                      = "LOG_ERROR"
                  + ApplyErrorUpdatePolicy                      = "LOG_ERROR"
                  + DataErrorEscalationCount                    = 0
                  + DataErrorEscalationPolicy                   = "SUSPEND_TABLE"
                  + DataErrorPolicy                             = "LOG_ERROR"
                  + DataTruncationErrorPolicy                   = "LOG_ERROR"
                  + EventErrorPolicy                            = "IGNORE"
                  + FailOnNoTablesCaptured                      = true
                  + FailOnTransactionConsistencyBreached        = false
                  + FullLoadIgnoreConflicts                     = true
                  + RecoverableErrorCount                       = -1
                  + RecoverableErrorInterval                    = 5
                  + RecoverableErrorStopRetryAfterThrottlingMax = true
                  + RecoverableErrorThrottling                  = true
                  + RecoverableErrorThrottlingMax               = 1800
                  + TableErrorEscalationCount                   = 0
                  + TableErrorEscalationPolicy                  = "STOP_TASK"
                  + TableErrorPolicy                            = "SUSPEND_TABLE"
                }
              + FailTaskWhenCleanTaskResourceFailed = false
              + FullLoadSettings                    = {
                  + CommitRate                      = 10000
                  + CreatePkAfterFullLoad           = false
                  + MaxFullLoadSubTasks             = 8
                  + StopTaskCachedChangesApplied    = false
                  + StopTaskCachedChangesNotApplied = false
                  + TargetTablePrepMode             = "DO_NOTHING"
                  + TransactionConsistencyTimeout   = 600
                }
              + Logging                             = {
                  + EnableLogContext = false
                  + EnableLogging    = true
                  + LogComponents    = [
                      + {
                          + Id       = "TRANSFORMATION"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "SOURCE_UNLOAD"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "IO"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "TARGET_LOAD"
                          + Severity = "LOGGER_SEVERITY_INFO"
                        },
                      + {
                          + Id       = "PERFORMANCE"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "SOURCE_CAPTURE"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "SORTER"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "REST_SERVER"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "VALIDATOR_EXT"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "TARGET_APPLY"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "TASK_MANAGER"
                          + Severity = "LOGGER_SEVERITY_DEBUG"
                        },
                      + {
                          + Id       = "TABLES_MANAGER"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "METADATA_MANAGER"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "FILE_FACTORY"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "COMMON"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "ADDONS"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "DATA_STRUCTURE"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "COMMUNICATION"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                      + {
                          + Id       = "FILE_TRANSFER"
                          + Severity = "LOGGER_SEVERITY_DEFAULT"
                        },
                    ]
                }
              + LoopbackPreventionSettings          = null
              + PostProcessingRules                 = null
              + StreamBufferSettings                = {
                  + CtrlStreamBufferSizeInMB = 5
                  + StreamBufferCount        = 3
                  + StreamBufferSizeInMB     = 8
                }
              + TTSettings                          = {
                  + EnableTT         = false
                  + TTRecordSettings = null
                  + TTS3Settings     = null
                }
              + TargetMetadata                      = {
                  + BatchApplyEnabled            = false
                  + FullLobMode                  = false
                  + InlineLobMaxSize             = 0
                  + LimitedSizeLobMode           = true
                  + LoadMaxFileSize              = 0
                  + LobChunkSize                 = 64
                  + LobMaxSize                   = 32
                  + ParallelApplyBufferSize      = 0
                  + ParallelApplyQueuesPerThread = 0
                  + ParallelApplyThreads         = 0
                  + ParallelLoadBufferSize       = 0
                  + ParallelLoadQueuesPerThread  = 0
                  + ParallelLoadThreads          = 0
                  + SupportLobs                  = true
                  + TargetSchema                 = ""
                  + TaskRecoveryTableEnabled     = false
                }
            }
        )
      + source_endpoint_arn       = "arn:aws:dms:ap-northeast-1:891377385718:endpoint:KI74UTLYZZA2NISFV4G4MUJUXE"
      + start_replication_task    = false
      + status                    = (known after apply)
      + table_mappings            = jsonencode(
            {
              + rules = [
                  + {
                      + object-locator = {
                          + schema-name = "store"
                          + table-name  = "store_item"
                        }
                      + rule-action    = "include"
                      + rule-id        = "1"
                      + rule-name      = "1"
                      + rule-type      = "selection"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "store"
                          + table-name  = "store_item"
                        }
                      + rule-action    = "rename"
                      + rule-id        = "2"
                      + rule-name      = "2"
                      + rule-target    = "schema"
                      + rule-type      = "transformation"
                      + value          = "mono_v2"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "store"
                          + table-name  = "store_item"
                        }
                      + rule-action    = "rename"
                      + rule-id        = "3"
                      + rule-name      = "3"
                      + rule-target    = "table"
                      + rule-type      = "transformation"
                      + value          = "product_variants"
                    },
                  + {
                      + object-locator = {
                          + column-name = "product_id"
                          + schema-name = "store"
                          + table-name  = "store_item"
                        }
                      + rule-action    = "include-column"
                      + rule-id        = "4"
                      + rule-name      = "4"
                      + rule-target    = "column"
                      + rule-type      = "transformation"
                    },
                ]
            }
        )
      + tags_all                  = (known after apply)
      + target_endpoint_arn       = "arn:aws:dms:ap-northeast-1:891377385718:endpoint:HZBSGD6IPFG6HF7Q6SAUZDU74E"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/shimizu-atsuyoshi/live-fire-exercise/issues/16/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":16,"Program":"tfcmt","SHA1":"e197a0728aaaf96b39ef8e4c9e83b153175f514c","Vars":{},"WorkflowName":"aws plan"} -->